In [70]:
import pandas as pd

In [71]:
data = dict(
            names = ["aliu","sanusi", "halima", "sanusi", "halima", "halima", "sanusi", "sanusi"],
            scores = [23, 19, 55, 98, 50, 80, 45, 19],
            ages = [30, 30, 28, 27, 20, 34, 60, 88]
            )

In [72]:
# creating pandas dataframe
df = pd.DataFrame(data)
df

    names  scores  ages
0    aliu      23    30
1  sanusi      19    30
2  halima      55    28
3  sanusi      98    27
4  halima      50    20
5  halima      80    34
6  sanusi      45    60
7  sanusi      19    88

In [73]:
type(df)

pandas.core.frame.DataFrame

In [74]:
# series is a slice of a dataframe
names = df.names
names

0      aliu
1    sanusi
2    halima
3    sanusi
4    halima
5    halima
6    sanusi
7    sanusi
Name: names, dtype: object

In [75]:
type(names)

pandas.core.series.Series

In [76]:
# PANDAS .ILOC attribute ALLOWS ONE TO FETCH ACROSS THE ROW INDICES
aliu = df.iloc[1]
aliu

names     sanusi
scores        19
ages          30
Name: 1, dtype: object

In [77]:
# # pandas dataframe index can be switched to something else, maybe a column of your data.
# df.index = df.names

In [78]:
df

    names  scores  ages
0    aliu      23    30
1  sanusi      19    30
2  halima      55    28
3  sanusi      98    27
4  halima      50    20
5  halima      80    34
6  sanusi      45    60
7  sanusi      19    88

In [79]:
# df.loc["aliu"]

In [80]:
# quick technical detail about data frame
# take note that pandas takes strings as objects

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   8 non-null      object
 1   scores  8 non-null      int64
 2   ages    8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [81]:
# .describe method gives statistical information on your dataframe
df.describe() # describes only the numeric columns

         scores       ages
count   8.00000   8.000000
mean   48.62500  39.625000
std    29.00708  22.840675
min    19.00000  20.000000
25%    22.00000  27.750000
50%    47.50000  30.000000
75%    61.25000  40.500000
max    98.00000  88.000000

In [82]:
df.describe(include = ["O"]) #include 'O' same as include strings to describe.

         names
count        8
unique       3
top     sanusi
freq         4

In [84]:
df.names == "halima" # you can use a logical operator filter a dataframe or series this will return a boolean mask

0    False
1    False
2     True
3    False
4     True
5     True
6    False
7    False
Name: names, dtype: bool